---
kind: type
id: T:Autodesk.Revit.DB.SpatialElement
source: html/e73594e8-23aa-899f-82fb-3490def8ece2.htm
---
# Autodesk.Revit.DB.SpatialElement

Represents an enclosed area or volume in the Revit model.

## Syntax (C#)
```csharp
public class SpatialElement : Element
```